In [1]:
import numpy as np 
import pandas as pd

## Pivot Tables

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)
df

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    129     94   John
1  2023-01-02       B   West    801     12   Mary
2  2023-01-03       C  North    721     23    Bob
3  2023-01-04       D  South    133     45  Alice
4  2023-01-05       A   East    416     28   John
5  2023-01-06       B   West    911     83   Mary
6  2023-01-07       C  North    449     34    Bob
7  2023-01-08       D  South    570     16  Alice
8  2023-01-09       A   East    323     29   John
9  2023-01-10       B   West    862     73   Mary
10 2023-01-11       C  North    420     49    Bob
11 2023-01-12       D  South    434     67  Alice
12 2023-01-13       A   East    503     64   John
13 2023-01-14       B   West    541     85   Mary
14 2023-01-15       C  North    309     83    Bob
15 2023-01-16       D  South    118     72  Alice
16 2023-01-17       A   East    647     44   John
17 2023-01-18       B   West    241     38   Mary
18 2023-01-19       C  North    250     27    Bob
19 2023-01-20       D  South    131     66  Alice

In [3]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product",aggfunc = 'median')

Product      A      B      C      D
Region
East     416.0    NaN    NaN    NaN
North      NaN    NaN  420.0    NaN
South      NaN    NaN    NaN  133.0
West       NaN  801.0    NaN    NaN

In [4]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     403.6    NaN    NaN    NaN  51.8   NaN   NaN   NaN
North      NaN    NaN  429.8    NaN   NaN   NaN  43.2   NaN
South      NaN    NaN    NaN  277.2   NaN   NaN   NaN  53.2
West       NaN  671.2    NaN    NaN   NaN  58.2   NaN   NaN

## Cross Tabs

In [5]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0